# ************************************************************
# Sequel Ace SQL dump
# Version 20064
#
# https://sequel-ace.com/
# https://github.com/Sequel-Ace/Sequel-Ace
#
# Host: 146.56.161.10 (MySQL 8.3.0)
# Database: slavseat_dev
# Generation Time: 2024-03-29 16:13:54 +0000
# ************************************************************


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
SET NAMES utf8mb4;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE='NO_AUTO_VALUE_ON_ZERO', SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


# Dump of table facility
# ------------------------------------------------------------

DROP TABLE IF EXISTS `facility`;

CREATE TABLE `facility` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `x` int NOT NULL,
  `y` int NOT NULL,
  `w` int NOT NULL,
  `h` int NOT NULL,
  `type` int NOT NULL,
  `floorId` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FK_b27787d2572f52a8a07cea69229` (`floorId`),
  CONSTRAINT `FK_b27787d2572f52a8a07cea69229` FOREIGN KEY (`floorId`) REFERENCES `floor` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=117 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

LOCK TABLES `facility` WRITE;
/*!40000 ALTER TABLE `facility` DISABLE KEYS */;

INSERT INTO `facility` (`id`, `name`, `x`, `y`, `w`, `h`, `type`, `floorId`)
VALUES
	(1,'1번 좌석',8,0,2,2,1,2),
	(2,'2번 좌석',10,0,2,2,1,2),
	(3,'3번 좌석',6,3,2,2,1,2),
	(4,'4번 좌석',8,3,2,2,1,2),
	(5,'5번 좌석',10,3,2,2,1,2),
	(6,'6번 좌석',6,5,2,2,1,2),
	(7,'7번 좌석',8,5,2,2,1,2),
	(8,'8번 좌석',10,5,2,2,1,2),
	(9,'9번 좌석',4,8,2,2,1,2),
	(10,'10번 좌석',6,8,2,2,1,2),
	(11,'11번 좌석',8,8,2,2,1,2),
	(12,'12번 좌석',10,8,2,2,1,2),
	(13,'13번 좌석',4,10,2,2,1,2),
	(14,'14번 좌석',6,10,2,2,1,2),
	(15,'15번 좌석',8,10,2,2,1,2),
	(16,'16번 좌석',10,10,2,2,1,2),
	(17,'17번 좌석',4,13,2,2,1,2),
	(18,'18번 좌석',6,13,2,2,1,2),
	(19,'19번 좌석',8,13,2,2,1,2),
	(20,'20번 좌석',10,13,2,2,1,2),
	(21,'커뮤니티실',7,16,5,6,0,2),
	(22,'7.1 회의실',3,16,4,4,2,2),
	(23,'7.2 회의실',5,20,2,2,2,2),
	(24,'7.4 회의실',0,20,3,2,2,2),
	(25,'7.3 회의실',3,20,2,2,2,2),
	(26,'21번 좌석',15,0,2,2,1,2),
	(27,'22번 좌석',17,0,2,2,1,2),
	(28,'23번 좌석',19,0,2,2,1,2),
	(29,'24번 좌석',21,0,2,2,1,2),
	(30,'25번 좌석',15,4,2,2,1,2),
	(31,'26번 좌석',17,4,2,2,1,2),
	(32,'27번 좌석',19,4,2,2,1,2),
	(33,'28번 좌석',21,4,2,2,1,2),
	(34,'29번 좌석',17,6,2,2,1,2),
	(35,'30번 좌석',19,6,2,2,1,2),
	(36,'31번 좌석',21,6,2,2,1,2),
	(37,'32번 좌석',15,9,2,2,1,2),
	(38,'33번 좌석',17,9,2,2,1,2),
	(39,'34번 좌석',19,9,2,2,1,2),
	(40,'35번 좌석',21,9,2,2,1,2),
	(41,'36번 좌석',15,11,2,2,1,2),
	(42,'37번 좌석',17,11,2,2,1,2),
	(43,'38번 좌석',19,11,2,2,1,2),
	(44,'39번 좌석',21,11,2,2,1,2),
	(45,'40번 좌석',15,14,2,2,1,2),
	(46,'41번 좌석',17,14,2,2,1,2),
	(47,'42번 좌석',19,14,2,2,1,2),
	(48,'43번 좌석',21,14,2,2,1,2),
	(49,'44번 좌석',15,16,2,2,1,2),
	(50,'45번 좌석',17,16,2,2,1,2),
	(51,'46번 좌석',19,16,2,2,1,2),
	(52,'47번 좌석',21,16,2,2,1,2),
	(53,'48번 좌석',15,19,2,2,1,2),
	(54,'49번 좌석',17,19,2,2,1,2),
	(55,'50번 좌석',19,19,2,2,1,2),
	(56,'51번 좌석',21,19,2,2,1,2),
	(57,'59번 좌석',4,0,2,2,1,1),
	(58,'60번 좌석',6,0,2,2,1,1),
	(59,'61번 좌석',8,0,2,2,1,1),
	(60,'56번 좌석',4,2,2,2,1,1),
	(61,'57번 좌석',6,2,2,2,1,1),
	(62,'58번 좌석',8,2,2,2,1,1),
	(63,'53번 좌석',4,5,2,2,1,1),
	(64,'54번 좌석',6,5,2,2,1,1),
	(65,'55번 좌석',8,5,2,2,1,1),
	(66,'50번 좌석',4,7,2,2,1,1),
	(67,'51번 좌석',6,7,2,2,1,1),
	(68,'52번 좌석',8,7,2,2,1,1),
	(69,'62번 좌석',12,0,2,2,1,1),
	(70,'63번 좌석',12,2,2,2,1,1),
	(71,'64번 좌석',15,0,2,2,1,1),
	(72,'65번 좌석',15,2,2,2,1,1),
	(73,'66번 좌석',17,0,2,2,1,1),
	(74,'67번 좌석',17,2,2,2,1,1),
	(75,'68번 좌석',20,0,2,2,1,1),
	(76,'69번 좌석',20,2,2,2,1,1),
	(77,'70번 좌석',22,0,2,2,1,1),
	(78,'71번 좌석',22,2,2,2,1,1),
	(79,'41번 좌석',3,12,2,2,1,1),
	(80,'42번 좌석',3,14,2,2,1,1),
	(81,'43번 좌석',3,16,2,2,1,1),
	(82,'38번 좌석',0,12,2,2,1,1),
	(83,'39번 좌석',0,14,2,2,1,1),
	(84,'40번 좌석',0,16,2,2,1,1),
	(85,'44번 좌석',5,12,2,2,1,1),
	(86,'45번 좌석',5,14,2,2,1,1),
	(87,'46번 좌석',5,16,2,2,1,1),
	(88,'47번 좌석',8,12,2,2,1,1),
	(89,'48번 좌석',8,14,2,2,1,1),
	(90,'49번 좌석',8,16,2,2,1,1),
	(91,'탕비실',14,6,8,3,0,1),
	(92,'회의실 3.1',11,12,4,4,2,1),
	(93,'회의실 3.2',15,12,4,4,2,1),
	(94,'회의실 3.3',19,11,3,5,2,1),
	(95,'72번 좌석',25,0,2,2,1,1),
	(96,'73번 좌석',25,2,2,2,1,1),
	(97,'74번 좌석',27,0,2,2,1,1),
	(98,'75번 좌석',27,2,2,2,1,1),
	(99,'76번 좌석',23,5,2,2,1,1),
	(100,'77번 좌석',25,5,2,2,1,1),
	(101,'78번 좌석',27,5,2,2,1,1),
	(102,'79번 좌석',23,7,2,2,1,1),
	(103,'80번 좌석',25,7,2,2,1,1),
	(104,'81번 좌석',27,7,2,2,1,1),
	(105,'82번 좌석',23,10,2,2,1,1),
	(106,'83번 좌석',25,10,2,2,1,1),
	(107,'84번 좌석',27,10,2,2,1,1),
	(108,'85번 좌석',23,12,2,2,1,1),
	(109,'86번 좌석',25,12,2,2,1,1),
	(110,'87번 좌석',27,12,2,2,1,1),
	(111,'88번 좌석',23,15,2,2,1,1),
	(112,'89번 좌석',25,15,2,2,1,1),
	(113,'90번 좌석',27,15,2,2,1,1),
	(114,'91번 좌석',23,17,2,2,1,1),
	(115,'92번 좌석',25,17,2,2,1,1),
	(116,'93번 좌석',27,17,2,2,1,1);

/*!40000 ALTER TABLE `facility` ENABLE KEYS */;
UNLOCK TABLES;


# Dump of table floor
# ------------------------------------------------------------

DROP TABLE IF EXISTS `floor`;

CREATE TABLE `floor` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `imageId` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `REL_6ea05d068812a85caa90e8d1eb` (`imageId`),
  CONSTRAINT `FK_6ea05d068812a85caa90e8d1ebb` FOREIGN KEY (`imageId`) REFERENCES `object_meta` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

LOCK TABLES `floor` WRITE;
/*!40000 ALTER TABLE `floor` DISABLE KEYS */;

INSERT INTO `floor` (`id`, `name`, `imageId`)
VALUES
	(1,'3층',NULL),
	(2,'7층',NULL);

/*!40000 ALTER TABLE `floor` ENABLE KEYS */;
UNLOCK TABLES;



/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
